Revit 2027 API
StructuralSection.NominalWeight Property
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NominalWeight { get; set; }
Public Property NominalWeight As Double
	Get
	Set
public:
property double NominalWeight {
	double get ();
	void set (double value);
}
member NominalWeight : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace